StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE4.h
    struct {
      __IOM uint32_t ADC_C1_SEL : 2;            /*!< [1..0] ADC_C1 mux freq select                                             */
      __IOM uint32_t ADCIU_C1_SEL : 2;          /*!< [3..2] ADCIU_C1 mux freq select                                           */
      __IOM uint32_t ADC_C3_SEL : 4;            /*!< [7..4] ADC_C1 mux output freq devider, [/1, /2, /4 .. /256]               */
      __IOM uint32_t ADCIU_C3_SEL : 4;          /*!< [11..8] ADCIU_C1 mux output freq devider, [/1, /2, /4 .. /256]            */
      __IOM uint32_t ADCIU_CLK_EN : 1;          /*!< [12..12] ADCIU Clock Enable                                               */
      __IOM uint32_t ADC_CLK_EN : 1;            /*!< [13..13] ADC Clock Enable                                                 */
    } ADC_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t RTC_CLOCK;                   /*!< (@ 0x00000018) RTC Clock Control                                          */
    
    struct {
      __IOM uint32_t HSE_SEL    : 4;            /*!< [3..0] RTC HSE freq devider, [/1, /2, /4 .. /256]                         */
      __IOM uint32_t HSI_SEL    : 4;            /*!< [7..4] RTC HSI freq devider, [/1, /2, /4 .. /256]                         */
      __IOM uint32_t HSE_RTC_EN : 1;            /*!< [8..8] RTC HSE Clock enable                                               */
      __IOM uint32_t HSI_RTC_EN : 1;            /*!< [9..9] RTC HSI Clock enable                                               */
    } RTC_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t PER2_CLOCK;                  /*!< (@ 0x0000001C) Peripherials Clock Control 2                               */
    
    struct {
      __IOM uint32_t SPI1_CLK_EN : 1;           /*!< [0..0] SPI1 Clock Enable                                                  */
      __IOM uint32_t UART1_CLK_EN : 1;          /*!< [1..1] UART1 Clock Enable                                                 */
      __IOM uint32_t UART2_CLK_EN : 1;          /*!< [2..2] UART2 Clock Enable                                                 */
      __IOM uint32_t EEPROM_CLK_EN : 1;         /*!< [3..3] EEPROM Clock Enable                                                */
      __IOM uint32_t RST_CLK_EN : 1;            /*!< [4..4] RST Clock Enable                                                   */
      __IOM uint32_t DMA_CLK_EN : 1;            /*!< [5..5] DMA Clock Enable                                                   */
      __IOM uint32_t CMP_CLK_EN : 1;            /*!< [6..6] CMP Clock Enable                                                   */
      __IOM uint32_t DAC_CLK_EN : 1;            /*!< [7..7] DAC Clock Enable                                                   */
      __IOM uint32_t ADC_CLK_EN : 1;            /*!< [8..8] ADC Clock Enable                                                   */
      __IOM uint32_t WWDT_CLK_EN : 1;           /*!< [9..9] WWDT Clock Enable                                                  */
      __IOM uint32_t IWDT_CLK_EN : 1;           /*!< [10..10] IWDT Clock Enable                                                */
      __IOM uint32_t PWR_CLK_EN : 1;            /*!< [11..11] Power Clock Enable                                               */
      __IOM uint32_t BKP_CLK_EN : 1;            /*!< [12..12] Backup Clock Enable                                              */
      __IOM uint32_t ADCIU_CLK_EN : 1;          /*!< [13..13] ADCIU Clock Enable                                               */
      __IOM uint32_t TIMER1_CLK_EN : 1;         /*!< [14..14] TIMER1 Clock Enable                                              */
      __IOM uint32_t TIMER2_CLK_EN : 1;         /*!< [15..15] TIMER2 Clock Enable                                              */
      __IOM uint32_t PORTA_CLK_EN : 1;          /*!< [16..16] GPIO PORT_A Clock Enable                                         */
      __IOM uint32_t PORTB_CLK_EN : 1;          /*!< [17..17] GPIO PORT_B Clock Enable                                         */
      __IOM uint32_t PORTC_CLK_EN : 1;          /*!< [18..18] GPIO PORT_C Clock Enable                                         */
      __IOM uint32_t CRC_CLK_EN : 1;            /*!< [19..19] CRC Clock Enable                                                 */
    } PER2_CLOCK_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t TIM_CLOCK;                   /*!< (@ 0x00000024) Timer's Clock Control                                      */
    
    struct {
      __IOM uint32_t TIM1_BRG   : 3;            /*!< [2..0] PER1_C2 freq divider to get TIM1_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIM2_BRG   : 3;            /*!< [10..8] PER1_C2 freq divider to get TIM2_CLOCK, [/1, /2, /4
                                                     .. /128]                                                                  */
      __IM  uint32_t            : 13;
      __IOM uint32_t TIM1_CLK_EN : 1;           /*!< [24..24] TIM1_CLOCK enable                                                */
      __IOM uint32_t TIM2_CLK_EN : 1;           /*!< [25..25] TIM2_CLOCK enable                                                */
    } TIM_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t UART_CLOCK;                  /*!< (@ 0x00000028) UART's Clock Control                                       */
    
    struct {
      __IOM uint32_t UART1_BRG  : 3;            /*!< [2..0] PER1_C2 freq divider to get UART1_CLOCK, [/1, /2, /4
                                                     .. /128]                                                                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t UART2_BRG  : 3;            /*!< [10..8] PER1_C2 freq divider to get UART2_CLOCK, [/1, /2, /4
                                                     .. /128]                                                                  */
      __IM  uint32_t            : 13;
      __IOM uint32_t UART1_CLK_EN : 1;          /*!< [24..24] UART1_CLOCK enable                                               */
      __IOM uint32_t UART2_CLK_EN : 1;          /*!< [25..25] UART2_CLOCK enable                                               */
    } UART_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t SSP_CLOCK;                   /*!< (@ 0x0000002C) SSP's Clock Control                                        */
    
