StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE4.h
    struct {
      __IOM uint32_t Pin_0      : 2;            /*!< [1..0] Pin Digital Function                                               */
      __IOM uint32_t Pin_1      : 2;            /*!< [3..2] Pin Digital Function                                               */
      __IOM uint32_t Pin_2      : 2;            /*!< [5..4] Pin Digital Function                                               */
      __IOM uint32_t Pin_3      : 2;            /*!< [7..6] Pin Digital Function                                               */
      __IOM uint32_t Pin_4      : 2;            /*!< [9..8] Pin Digital Function                                               */
      __IOM uint32_t Pin_5      : 2;            /*!< [11..10] Pin Digital Function                                             */
      __IOM uint32_t Pin_6      : 2;            /*!< [13..12] Pin Digital Function                                             */
      __IOM uint32_t Pin_7      : 2;            /*!< [15..14] Pin Digital Function                                             */
      __IOM uint32_t Pin_8      : 2;            /*!< [17..16] Pin Digital Function                                             */
      __IOM uint32_t Pin_9      : 2;            /*!< [19..18] Pin Digital Function                                             */
      __IOM uint32_t Pin_10     : 2;            /*!< [21..20] Pin Digital Function                                             */
      __IOM uint32_t Pin_11     : 2;            /*!< [23..22] Pin Digital Function                                             */
      __IOM uint32_t Pin_12     : 2;            /*!< [25..24] Pin Digital Function                                             */
      __IOM uint32_t Pin_13     : 2;            /*!< [27..26] Pin Digital Function                                             */
      __IOM uint32_t Pin_14     : 2;            /*!< [29..28] Pin Digital Function                                             */
      __IOM uint32_t Pin_15     : 2;            /*!< [31..30] Pin Digital Function                                             */
    } FUNC_b;
  } ;
  
  union {
    __IOM uint32_t ANALOG;                      /*!< (@ 0x0000000C) Enable Digital Mode Control                                */
    
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Enable Digital mode                                                */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Enable Digital mode                                                */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Enable Digital mode                                                */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Enable Digital mode                                                */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Enable Digital mode                                                */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Enable Digital mode                                                */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Enable Digital mode                                                */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Enable Digital mode                                                */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Enable Digital mode                                                */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Enable Digital mode                                                */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Enable Digital mode                                              */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Enable Digital mode                                              */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Enable Digital mode                                              */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Enable Digital mode                                              */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Enable Digital mode                                              */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Enable Digital mode                                              */
    } ANALOG_b;
  } ;
  
  union {
    __IOM uint32_t PULL;                        /*!< (@ 0x00000010) PULL Up and Down Control                                   */
    
    struct {
      __IOM uint32_t Down_Pin_0 : 1;            /*!< [0..0] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_1 : 1;            /*!< [1..1] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_2 : 1;            /*!< [2..2] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_3 : 1;            /*!< [3..3] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_4 : 1;            /*!< [4..4] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_5 : 1;            /*!< [5..5] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_6 : 1;            /*!< [6..6] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_7 : 1;            /*!< [7..7] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_8 : 1;            /*!< [8..8] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_9 : 1;            /*!< [9..9] Pull Down Enable                                                   */
      __IOM uint32_t Down_Pin_10 : 1;           /*!< [10..10] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_11 : 1;           /*!< [11..11] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_12 : 1;           /*!< [12..12] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_13 : 1;           /*!< [13..13] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_14 : 1;           /*!< [14..14] Pull Down Enable                                                 */
      __IOM uint32_t Down_Pin_15 : 1;           /*!< [15..15] Pull Down Enable                                                 */
      __IOM uint32_t UP_Pin_0   : 1;            /*!< [16..16] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_1   : 1;            /*!< [17..17] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_2   : 1;            /*!< [18..18] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_3   : 1;            /*!< [19..19] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_4   : 1;            /*!< [20..20] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_5   : 1;            /*!< [21..21] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_6   : 1;            /*!< [22..22] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_7   : 1;            /*!< [23..23] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_8   : 1;            /*!< [24..24] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_9   : 1;            /*!< [25..25] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_10  : 1;            /*!< [26..26] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_11  : 1;            /*!< [27..27] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_12  : 1;            /*!< [28..28] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_13  : 1;            /*!< [29..29] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_14  : 1;            /*!< [30..30] Pull Up Enable                                                   */
      __IOM uint32_t UP_Pin_15  : 1;            /*!< [31..31] Pull Up Enable                                                   */
    } PULL_b;
  } ;
  
  union {
    __IOM uint32_t PD;                          /*!< (@ 0x00000014) Otput Driver Mode                                          */
    
