StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE4.h
    struct {
      __IOM uint32_t Driver_Pin_0 : 1;          /*!< [0..0] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_1 : 1;          /*!< [1..1] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_2 : 1;          /*!< [2..2] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_3 : 1;          /*!< [3..3] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_4 : 1;          /*!< [4..4] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_5 : 1;          /*!< [5..5] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_6 : 1;          /*!< [6..6] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_7 : 1;          /*!< [7..7] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_8 : 1;          /*!< [8..8] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_9 : 1;          /*!< [9..9] Driver mode for pin                                                */
      __IOM uint32_t Driver_Pin_10 : 1;         /*!< [10..10] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_11 : 1;         /*!< [11..11] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_12 : 1;         /*!< [12..12] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_13 : 1;         /*!< [13..13] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_14 : 1;         /*!< [14..14] Driver mode for pin                                              */
      __IOM uint32_t Driver_Pin_15 : 1;         /*!< [15..15] Driver mode for pin                                              */
      __IOM uint32_t Schmitt_Pin_0 : 1;         /*!< [16..16] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_1 : 1;         /*!< [17..17] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_2 : 1;         /*!< [18..18] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_3 : 1;         /*!< [19..19] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_4 : 1;         /*!< [20..20] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_5 : 1;         /*!< [21..21] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_6 : 1;         /*!< [22..22] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_7 : 1;         /*!< [23..23] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_8 : 1;         /*!< [24..24] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_9 : 1;         /*!< [25..25] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_10 : 1;        /*!< [26..26] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_11 : 1;        /*!< [27..27] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_12 : 1;        /*!< [28..28] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_13 : 1;        /*!< [29..29] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_14 : 1;        /*!< [30..30] Schmitt trigger enable                                           */
      __IOM uint32_t Schmitt_Pin_15 : 1;        /*!< [31..31] Schmitt trigger enable                                           */
    } PD_b;
  } ;
  
  union {
    __IOM uint32_t PWR;                         /*!< (@ 0x00000018) Output voltage switch rate                                 */
    
    struct {
      __IOM uint32_t Pin_0      : 2;            /*!< [1..0] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_1      : 2;            /*!< [3..2] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_2      : 2;            /*!< [5..4] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_3      : 2;            /*!< [7..6] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_4      : 2;            /*!< [9..8] Voltage levels switch rate                                         */
      __IOM uint32_t Pin_5      : 2;            /*!< [11..10] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_6      : 2;            /*!< [13..12] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_7      : 2;            /*!< [15..14] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_8      : 2;            /*!< [17..16] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_9      : 2;            /*!< [19..18] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_10     : 2;            /*!< [21..20] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_11     : 2;            /*!< [23..22] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_12     : 2;            /*!< [25..24] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_13     : 2;            /*!< [27..26] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_14     : 2;            /*!< [29..28] Voltage levels switch rate                                       */
      __IOM uint32_t Pin_15     : 2;            /*!< [31..30] Voltage levels switch rate                                       */
    } PWR_b;
  } ;
  
  union {
    __IOM uint32_t GFEN;                        /*!< (@ 0x0000001C) Input pulses filter                                        */
    
