StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE4.h
/* ======================================  MDR_RST_CLOCK UART_CLOCK UART2_BRG [8..10]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART_CLOCK_UART2_BRG                                        */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div1 = 0,  /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div2 = 1,  /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div4 = 2,  /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div8 = 3,  /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div16 = 4, /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div32 = 5, /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div64 = 6, /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div128 = 7,/*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_Enum;

/* ====================================  MDR_RST_CLOCK UART_CLOCK UART1_CLK_EN [24..24]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART_CLOCK_UART1_CLK_EN                                     */
  MDR_RST__UART__UART1_CLK__Off        = 0,     /*!< Off : UART1 Clock Disabled                                                */
  MDR_RST__UART__UART1_CLK__On         = 1,     /*!< On : UART1 Clock Enabled                                                  */
} MDR_RST__UART__UART1_CLK__Enum;

/* ====================================  MDR_RST_CLOCK UART_CLOCK UART2_CLK_EN [25..25]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART_CLOCK_UART2_CLK_EN                                     */
  MDR_RST__UART__UART2_CLK__Off        = 0,     /*!< Off : UART2 Clock Disabled                                                */
  MDR_RST__UART__UART2_CLK__On         = 1,     /*!< On : UART2 Clock Enabled                                                  */
} MDR_RST__UART__UART2_CLK__Enum;

/* =======================================================  SSP_CLOCK  ======================================================= */
/* ========================================  MDR_RST_CLOCK SSP_CLOCK SSP1_BRG [0..2]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG                                          */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div1 = 0,    /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div2 = 1,    /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div4 = 2,    /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div8 = 3,    /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div16 = 4,   /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div32 = 5,   /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div64 = 6,   /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div128 = 7,  /*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_Enum;

/* =====================================  MDR_RST_CLOCK SSP_CLOCK SSP1_CLK_EN [24..24]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP_CLOCK_SSP1_CLK_EN                                       */
  MDR_RST__SSP__SSP1_CLK__Off          = 0,     /*!< Off : SSP1 Clock Disabled                                                 */
  MDR_RST__SSP__SSP1_CLK__On           = 1,     /*!< On : SSP1 Clock Enabled                                                   */
} MDR_RST__SSP__SSP1_CLK__Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_WWDT                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
/* ================================================  MDR_WWDT CR WDGA [7..7]  ================================================ */
typedef enum {                                  /*!< MDR_WWDT_CR_WDGA                                                          */
  MDR_WWDG_EN__Off                     = 0,     /*!< Off : Disabled                                                            */
  MDR_WWDG_EN__On                      = 1,     /*!< On : Enabled                                                              */
} MDR_WWDG_EN__Enum;

/* ==========================================================  CFR  ========================================================== */
/* ===============================================  MDR_WWDT CFR WGTB [7..8]  ================================================ */
typedef enum {                                  /*!< MDR_WWDT_CFR_WGTB                                                         */
  MDR_CFR_WGTB___div1                  = 0,     /*!< div1 : CLK = LSI/4096/1                                                   */
  MDR_CFR_WGTB___div2                  = 1,     /*!< div2 : CLK = LSI/4096/2                                                   */
  MDR_CFR_WGTB___div4                  = 2,     /*!< div4 : CLK = LSI/4096/4                                                   */
  MDR_CFR_WGTB___div8                  = 3,     /*!< div8 : CLK = LSI/4096/8                                                   */
} MDR_CFR_WGTB___Enum;

/* ================================================  MDR_WWDT CFR EWI [9..9]  ================================================ */
typedef enum {                                  /*!< MDR_WWDT_CFR_EWI                                                          */
  MDR_CFR_EWI___Off                    = 0,     /*!< Off : Disabled IRQ on T=0x40                                              */
  MDR_CFR_EWI___On                     = 1,     /*!< On : Enabled IRQ on T=0x40                                                */
} MDR_CFR_EWI___Enum;

/* ==========================================================  SR  =========================================================== */
/* ================================================  MDR_WWDT SR EWIF [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_WWDT_SR_EWIF                                                          */
  MDR_SR_EWIF___Off                    = 0,     /*!< Off : Event Off                                                           */
  MDR_SR_EWIF___Onn                    = 1,     /*!< Onn : Event On                                                            */
} MDR_SR_EWIF___Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_IWDT                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  KR  =========================================================== */
/* ==========================================================  PR  =========================================================== */
/* =================================================  MDR_IWDT PR PR [0..2]  ================================================= */
typedef enum {                                  /*!< MDR_IWDT_PR_PR                                                            */
  MDR_IWDT_PR___div4                   = 0,     /*!< div4 : LSI div 4                                                          */
  MDR_IWDT_PR___div8                   = 1,     /*!< div8 : LSI div 8                                                          */
  MDR_IWDT_PR___div16                  = 2,     /*!< div16 : LSI div 16                                                        */
  MDR_IWDT_PR___div32                  = 3,     /*!< div32 : LSI div 32                                                        */
  MDR_IWDT_PR___div64                  = 4,     /*!< div64 : LSI div 64                                                        */
  MDR_IWDT_PR___div128                 = 5,     /*!< div128 : LSI div 128                                                      */
  MDR_IWDT_PR___div256                 = 6,     /*!< div256 : LSI div 256                                                      */
  MDR_IWDT_PR___div256_1               = 7,     /*!< div256_1 : LSI div 256                                                    */
} MDR_IWDT_PR___Enum;

