StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE4.h
/* ===============================================  MDR_UART1 DR BE [10..10]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_DR_BE                                                           */
  MDR_UART1_DR_BE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_BE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_BE_Enum;

/* ===============================================  MDR_UART1 DR OE [11..11]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_DR_OE                                                           */
  MDR_UART1_DR_OE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_OE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_OE_Enum;

/* ========================================================  RSR_ECR  ======================================================== */
/* ==============================================  MDR_UART1 RSR_ECR FE [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RSR_ECR_FE                                                      */
  MDR_UART1_RSR_ECR_FE_Ok              = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_RSR_ECR_FE_ERROR           = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_RSR_ECR_FE_Enum;

/* ==============================================  MDR_UART1 RSR_ECR PE [1..1]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RSR_ECR_PE                                                      */
  MDR_UART1_RSR_ECR_PE_Ok              = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_RSR_ECR_PE_ERROR           = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_RSR_ECR_PE_Enum;

/* ==============================================  MDR_UART1 RSR_ECR BE [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RSR_ECR_BE                                                      */
  MDR_UART1_RSR_ECR_BE_Ok              = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_RSR_ECR_BE_ERROR           = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_RSR_ECR_BE_Enum;

/* ==============================================  MDR_UART1 RSR_ECR OE [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RSR_ECR_OE                                                      */
  MDR_UART1_RSR_ECR_OE_Ok              = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_RSR_ECR_OE_ERROR           = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_RSR_ECR_OE_Enum;

/* ==========================================================  FR  =========================================================== */
/* ================================================  MDR_UART1 FR CTS [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_CTS                                                          */
  MDR_UART1_FR_CTS_Inactive            = 0,     /*!< Inactive : Modem line is High                                             */
  MDR_UART1_FR_CTS_Active              = 1,     /*!< Active : Modem line is Low                                                */
} MDR_UART1_FR_CTS_Enum;

/* ================================================  MDR_UART1 FR DSR [1..1]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_DSR                                                          */
  MDR_UART1_FR_DSR_Inactive            = 0,     /*!< Inactive : Modem line is High                                             */
  MDR_UART1_FR_DSR_Active              = 1,     /*!< Active : Modem line is Low                                                */
} MDR_UART1_FR_DSR_Enum;

/* ================================================  MDR_UART1 FR DCD [2..2]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_DCD                                                          */
  MDR_UART1_FR_DCD_Inactive            = 0,     /*!< Inactive : Modem line is High                                             */
  MDR_UART1_FR_DCD_Active              = 1,     /*!< Active : Modem line is Low                                                */
} MDR_UART1_FR_DCD_Enum;

/* ===============================================  MDR_UART1 FR BUSY [3..3]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_BUSY                                                         */
  MDR_UART1_FR_BUSY_Off                = 0,     /*!< Off : Inactive                                                            */
  MDR_UART1_FR_BUSY_On                 = 1,     /*!< On : Active                                                               */
} MDR_UART1_FR_BUSY_Enum;

/* ===============================================  MDR_UART1 FR RXFE [4..4]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_RXFE                                                         */
  MDR_UART1_FR_RXFE_Inactive           = 0,     /*!< Inactive : FIFO not Empty                                                 */
  MDR_UART1_FR_RXFE_Empty              = 1,     /*!< Empty : FIFO Empty                                                        */
} MDR_UART1_FR_RXFE_Enum;

