StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE4.h
/* ==========================================  MDR_PORTA PD Driver_Pin_13 [13..13]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_13                                                */
  MDR_PORTA_PD_Driver_Pin_13_Driver    = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_13_OpenDrain = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_13_Enum;

/* ==========================================  MDR_PORTA PD Driver_Pin_14 [14..14]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_14                                                */
  MDR_PORTA_PD_Driver_Pin_14_Driver    = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_14_OpenDrain = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_14_Enum;

/* ==========================================  MDR_PORTA PD Driver_Pin_15 [15..15]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_15                                                */
  MDR_PORTA_PD_Driver_Pin_15_Driver    = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_15_OpenDrain = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_15_Enum;

/* ==========================================  MDR_PORTA PD Schmitt_Pin_ [16..16]  =========================================== */
typedef enum {                                  /*!< MDR_PORTA_PD_Schmitt_Pin_                                                 */
  MDR_GPIO__PIN_SHMITT__Off            = 0,     /*!< Off : Schmitt 200mv                                                       */
  MDR_GPIO__PIN_SHMITT__On             = 1,     /*!< On : Schmitt 400mv                                                        */
} MDR_GPIO__PIN_SHMITT__Enum;

/* ==========================================================  PWR  ========================================================== */
/* ===============================================  MDR_PORTA PWR Pin_ [0..1]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_PWR_Pin_                                                        */
  MDR_GPIO__PIN_PWR__Off               = 0,     /*!< Off : Level switch disabled                                               */
  MDR_GPIO__PIN_PWR__Slow              = 1,     /*!< Slow : Levels switch rate about 100ns                                     */
  MDR_GPIO__PIN_PWR__Fast              = 2,     /*!< Fast : Levels switch rate about 20ns                                      */
  MDR_GPIO__PIN_PWR__MaxFast           = 3,     /*!< MaxFast : Levels switch rate about 10ns                                   */
} MDR_GPIO__PIN_PWR__Enum;

/* =========================================================  GFEN  ========================================================== */
/* ==============================================  MDR_PORTA GFEN Pin_ [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_GFEN_Pin_                                                       */
  MDR_GPIO__PIN_GFEN__Off              = 0,     /*!< Off : Filter Off                                                          */
  MDR_GPIO__PIN_GFEN__On               = 1,     /*!< On : Filter pulses less then 10 ns                                        */
} MDR_GPIO__PIN_GFEN__Enum;


/** @} */ /* End of group EnumValue_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* MDR1986VE4_H */


/** @} */ /* End of group MDR1986VE4 */

/** @} */ /* End of group Milandr */
